// Разработайте программу, которая позволяет пользователю ввести два числа
// и выбрать операцию, которая будет применена к этим числам.
// Реализуйте три функции: addNumbers (сложение), subtractNumbers (вычитание)
// и multiplyNumbers (умножение). Одна функция должна использовать передачу
// аргументов по значению, другая - передачу аргументов по адресу,
// а третья - передачу аргументов по ссылке.
//
// Задачи для выполнения программы:
//
// Спросите у пользователя два числа и сохраните их в две переменные.
// Спросите у пользователя, какую операцию он хочет выполнить: сложение, вычитание или умножение.
// В зависимости от выбора пользователя, вызовите соответствующую функцию, передав ей аргументы.
// В каждой функции выполните требуемую операцию с числами и выведите результат.
// Убедитесь, что каждая функция использует соответствующий метод передачи аргументов: по значению, по адресу или по ссылке.
// Запустите программу и протестируйте ее, вводя разные числа и выбирая разные операции.

#include <iostream>


int main(){

// Ввод пользователем два числа и сохраненеие их в две переменные
  int n1, n2;
  std::cout << "Введите два числа\nПервое число: ";
  std::cin >> n1;
  std::cout << "Второе число: ";
  std::cin >> n2;
//fdfjkd
// Ввод пользователем, какую операцию он хочет выполнить



  return 0;
}
